app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    @artists = Artist.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    @artist = Artist.find(params[:id])